Tried with `v1.0.1-rc2` to update `cost_center` value for all resources, but `terraform apply` failed with various errors. Probably there is deeper issue with resource update processing - provider tries to update everything.

After destroying all resources terraform apply wen successfully.

```
terraform apply -var-file test-config.tfvars
data.aws_secretsmanager_secret.megaport: Reading...
data.aws_secretsmanager_secret.megaport: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:893677514652:secret:megaport-dev-EMVzzv]
data.aws_secretsmanager_secret_version.megaport: Reading...
data.aws_secretsmanager_secret_version.megaport: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:893677514652:secret:megaport-dev-EMVzzv|AWSCURRENT]
data.megaport_location.this: Reading...
data.megaport_location.this: Read complete after 9s [name=Interxion FRA6]
megaport_port.ipxgrx: Refreshing state...
data.megaport_partner.internet: Reading...
data.megaport_partner.aws_port: Reading...
megaport_mve.fortigate: Refreshing state...
megaport_vxc.ipxgrx: Refreshing state...
data.megaport_partner.aws_port: Read complete after 9s
megaport_vxc.aws: Refreshing state...
data.megaport_partner.internet: Still reading... [10s elapsed]
data.megaport_partner.internet: Read complete after 11s
megaport_vxc.internet: Refreshing state...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # megaport_port.ipxgrx will be updated in-place
  ~ resource "megaport_port" "ipxgrx" {
      ~ attribute_tags         = {
          ~ terminated_service_details = {
              ~ device    = "" -> (known after apply)
              ~ interface = {
                  ~ demarcation   = "" -> (known after apply)
                  ~ loa_template  = "" -> (known after apply)
                  ~ media         = "" -> (known after apply)
                  ~ port_speed    = 0 -> (known after apply)
                  ~ resource_name = "" -> (known after apply)
                  ~ resource_type = "" -> (known after apply)
                  ~ shutdown      = false -> (known after apply)
                  ~ up            = 0 -> (known after apply)
                } -> (known after apply)
              ~ location  = {
                  ~ id        = 0 -> (known after apply)
                  ~ name      = "" -> (known after apply)
                  ~ site_code = "" -> (known after apply)
                } -> (known after apply)
            } -> (known after apply)
        } -> (known after apply)
      ~ cancelable             = true -> (known after apply)
      ~ contract_end_date      = "Thursday, 18-Jul-24 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date    = "Tuesday, 18-Jun-24 17:42:46 EEST" -> (known after apply)
      ~ cost_centre            = "A-TST-2024-GER-TST-TST" -> "A-TST-2024-GER-TST-TST1"
      ~ create_date            = "Tuesday, 18-Jun-24 17:41:53 EEST" -> (known after apply)
      ~ last_updated           = "Tuesday, 18-Jun-24 17:42:26 EEST" -> (known after apply)
      ~ live_date              = "Tuesday, 18-Jun-24 17:42:46 EEST" -> (known after apply)
      ~ locked                 = false -> (known after apply)
      ~ provisioning_status    = "LIVE" -> (known after apply)
      ~ resources              = {
          ~ interface = {
              ~ demarcation   = <<-EOT
                    Interxion FRA6
                    Hanauer Landstraße 298
                    Type: Single-mode Fibre Pair
                    Port: FRA6/CPR/ODF14/HU44, port 22
                EOT -> (known after apply)
              ~ description   = "" -> (known after apply)
              ~ id            = 0 -> (known after apply)
              ~ loa_template  = "gtt" -> (known after apply)
              ~ media         = "LR" -> (known after apply)
              ~ name          = "" -> (known after apply)
              ~ port_speed    = 10000 -> (known after apply)
              ~ resource_name = "interface" -> (known after apply)
              ~ resource_type = "interface" -> (known after apply)
              ~ up            = 1 -> (known after apply)
            } -> (known after apply)
        } -> (known after apply)
      + terminate_date         = (known after apply)
      ~ usage_algorithm        = "NOT_POST_PAID" -> (known after apply)
      ~ virtual                = false -> (known after apply)
      ~ vxc_auto_approval      = false -> (known after apply)
      ~ vxc_permitted          = true -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # megaport_vxc.aws will be updated in-place
  ~ resource "megaport_vxc" "aws" {
      ~ a_end                = {
          ~ current_product_uid   = "3f05c420-6342-4c8c-ba69-abbc15b83403" -> (known after apply)
          ~ location              = "Interxion FRA6" -> (known after apply)
          ~ location_id           = 130 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "e5f088f0-15b6-44da-88a9-3ef8569b94ec" -> (known after apply)
          ~ product_name          = "TEST-Frankfurt-ICSS-MVE" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
      ~ admin_locked         = false -> (known after apply)
      ~ attribute_tags       = {} -> (known after apply)
      ~ b_end                = {
          ~ current_product_uid   = "5ec445b7-6e15-4638-a2d7-8b9ab6ab0e62" -> (known after apply)
          ~ inner_vlan            = 0 -> (known after apply)
          ~ location              = "Interxion FRA6" -> (known after apply)
          ~ location_id           = 130 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "605cb850-dfb4-4a05-a171-8bf17757b3a2" -> (known after apply)
          ~ product_name          = "EU (Frankfurt) (eu-central-1)" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
          ~ vnic_index            = 0 -> (known after apply)
            # (3 unchanged attributes hidden)
        }
      ~ b_end_partner_config = {
          + partner_a_end_config = (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ cancelable           = true -> (known after apply)
      ~ company_name         = "1NCE GmbH" -> (known after apply)
      ~ contract_end_date    = "Thursday, 18-Jul-24 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date  = "Tuesday, 18-Jun-24 17:43:26 EEST" -> (known after apply)
      ~ cost_centre          = "A-TST-2024-GER-TST-TST" -> "A-TST-2024-GER-TST-TST1"
      ~ create_date          = "Tuesday, 18-Jun-24 17:42:34 EEST" -> (known after apply)
      ~ csp_connections      = [
          - {
              - bandwidth     = 100 -> null
              - bandwidths    = [
                  - 100,
                ] -> null
              - connect_type  = "AWSHC" -> null
              - connection_id = "" -> null
              - name          = "MEGAPORT" -> null
              - owner_account = "893677514652" -> null
              - resource_name = "b_csp_connection" -> null
              - resource_type = "csp_connection" -> null
            },
        ] -> (known after apply)
      ~ distance_band        = "METRO" -> (known after apply)
      ~ last_updated         = "Tuesday, 18-Jun-24 17:43:11 EEST" -> (known after apply)
      ~ live_date            = "Tuesday, 18-Jun-24 17:43:26 EEST" -> (known after apply)
      ~ locked               = false -> (known after apply)
      + port_interfaces      = (known after apply)
      ~ product_type         = "VXC" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
      + secondary_name       = (known after apply)
      ~ service_id           = 0 -> (known after apply)
      ~ shutdown             = false -> (known after apply)
      ~ usage_algorithm      = "POST_PAID_HOURLY_SPEED_METRO_VXC" -> (known after apply)
      + virtual_router       = (known after apply)
      ~ vll                  = {
          ~ a_vlan          = 2 -> (known after apply)
          ~ b_vlan          = 2 -> (known after apply)
          ~ description     = "" -> (known after apply)
          ~ id              = 0 -> (known after apply)
          ~ name            = "" -> (known after apply)
          ~ rate_limit_mbps = 100 -> (known after apply)
          ~ resource_name   = "vll" -> (known after apply)
          ~ resource_type   = "vll" -> (known after apply)
        } -> (known after apply)
      ~ vxc_approval         = {
          ~ message   = "" -> (known after apply)
          ~ new_speed = 0 -> (known after apply)
          ~ status    = "" -> (known after apply)
          ~ type      = "" -> (known after apply)
          ~ uid       = "" -> (known after apply)
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # megaport_vxc.internet will be updated in-place
  ~ resource "megaport_vxc" "internet" {
      ~ a_end                = {
          ~ current_product_uid   = "3f05c420-6342-4c8c-ba69-abbc15b83403" -> (known after apply)
          ~ inner_vlan            = 0 -> (known after apply)
          ~ location              = "Interxion FRA6" -> (known after apply)
          ~ location_id           = 130 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "e5f088f0-15b6-44da-88a9-3ef8569b94ec" -> (known after apply)
          ~ product_name          = "TEST-Frankfurt-ICSS-MVE" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ admin_locked         = false -> (known after apply)
      ~ attribute_tags       = {} -> (known after apply)
      ~ b_end                = {
          ~ current_product_uid   = "39072592-c92d-466d-bfff-8194b76987df" -> (known after apply)
          ~ inner_vlan            = 0 -> (known after apply)
          ~ location              = "Interxion FRA6" -> (known after apply)
          ~ location_id           = 130 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "2f83dc65-5d4c-4730-a66d-926db48a0326" -> (known after apply)
          ~ product_name          = "Megaport Internet" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
          ~ vnic_index            = 0 -> (known after apply)
            # (3 unchanged attributes hidden)
        }
      ~ cancelable           = true -> (known after apply)
      ~ company_name         = "1NCE GmbH" -> (known after apply)
      ~ contract_end_date    = "Thursday, 18-Jul-24 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date  = "Tuesday, 18-Jun-24 17:43:26 EEST" -> (known after apply)
      ~ cost_centre          = "A-TST-2024-GER-TST-TST" -> "A-TST-2024-GER-TST-TST1"
      ~ create_date          = "Tuesday, 18-Jun-24 17:42:31 EEST" -> (known after apply)
      ~ csp_connections      = [
          - {
              - connect_type         = "TRANSIT" -> null
              - customer_ip4_address = "162.43.146.29/31" -> null
              - customer_ip6_network = "2a0a:1800:d:e::/64" -> null
              - ipv4_gateway_address = "162.43.146.28" -> null
              - ipv6_gateway_address = "2a0a:1800:d:e::1" -> null
              - resource_name        = "b_csp_connection" -> null
              - resource_type        = "csp_connection" -> null
            },
        ] -> (known after apply)
      ~ distance_band        = "METRO" -> (known after apply)
      ~ last_updated         = "Tuesday, 18-Jun-24 17:43:07 EEST" -> (known after apply)
      ~ live_date            = "Tuesday, 18-Jun-24 17:43:26 EEST" -> (known after apply)
      ~ locked               = false -> (known after apply)
      + port_interfaces      = (known after apply)
      ~ product_type         = "VXC" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
      + secondary_name       = (known after apply)
      ~ service_id           = 0 -> (known after apply)
      ~ shutdown             = false -> (known after apply)
      ~ usage_algorithm      = "POST_PAID_HOURLY_NORMALISED_SPEED" -> (known after apply)
      + virtual_router       = (known after apply)
      ~ vll                  = {
          ~ a_vlan          = 2 -> (known after apply)
          ~ b_vlan          = 2 -> (known after apply)
          ~ description     = "" -> (known after apply)
          ~ id              = 0 -> (known after apply)
          ~ name            = "" -> (known after apply)
          ~ rate_limit_mbps = 100 -> (known after apply)
          ~ resource_name   = "vll" -> (known after apply)
          ~ resource_type   = "vll" -> (known after apply)
        } -> (known after apply)
      ~ vxc_approval         = {
          ~ message   = "" -> (known after apply)
          ~ new_speed = 0 -> (known after apply)
          ~ status    = "" -> (known after apply)
          ~ type      = "" -> (known after apply)
          ~ uid       = "" -> (known after apply)
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # megaport_vxc.ipxgrx will be updated in-place
  ~ resource "megaport_vxc" "ipxgrx" {
      ~ a_end                = {
          ~ current_product_uid   = "3f05c420-6342-4c8c-ba69-abbc15b83403" -> (known after apply)
          ~ location              = "Interxion FRA6" -> (known after apply)
          ~ location_id           = 130 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "e5f088f0-15b6-44da-88a9-3ef8569b94ec" -> (known after apply)
          ~ product_name          = "TEST-Frankfurt-ICSS-MVE" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
      ~ admin_locked         = false -> (known after apply)
      ~ attribute_tags       = {} -> (known after apply)
      ~ b_end                = {
          ~ current_product_uid   = "19a24a01-15c2-4228-9b42-cfb69571c595" -> (known after apply)
          ~ inner_vlan            = 0 -> (known after apply)
          ~ location              = "Interxion FRA6" -> (known after apply)
          ~ location_id           = 130 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "e5f088f0-15b6-44da-88a9-3ef8569b94ec" -> (known after apply)
          ~ product_name          = "TEST-Frankfurt-ICSS-Port" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
          ~ vnic_index            = 0 -> (known after apply)
            # (3 unchanged attributes hidden)
        }
      ~ cancelable           = true -> (known after apply)
      ~ company_name         = "1NCE GmbH" -> (known after apply)
      ~ contract_end_date    = "Thursday, 18-Jul-24 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date  = "Tuesday, 18-Jun-24 17:43:26 EEST" -> (known after apply)
      ~ cost_centre          = "A-TST-2024-GER-TST-TST" -> "A-TST-2024-GER-TST-TST1"
      ~ create_date          = "Tuesday, 18-Jun-24 17:42:31 EEST" -> (known after apply)
      + csp_connections      = (known after apply)
      ~ distance_band        = "METRO" -> (known after apply)
      ~ last_updated         = "Tuesday, 18-Jun-24 17:43:06 EEST" -> (known after apply)
      ~ live_date            = "Tuesday, 18-Jun-24 17:43:26 EEST" -> (known after apply)
      ~ locked               = false -> (known after apply)
      + port_interfaces      = (known after apply)
      ~ product_type         = "VXC" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
      + secondary_name       = (known after apply)
      ~ service_id           = 0 -> (known after apply)
      ~ shutdown             = false -> (known after apply)
      ~ usage_algorithm      = "POST_PAID_HOURLY_SPEED_METRO_VXC" -> (known after apply)
      + virtual_router       = (known after apply)
      ~ vll                  = {
          ~ a_vlan          = 2 -> (known after apply)
          ~ b_vlan          = 2 -> (known after apply)
          ~ description     = "" -> (known after apply)
          ~ id              = 0 -> (known after apply)
          ~ name            = "" -> (known after apply)
          ~ rate_limit_mbps = 100 -> (known after apply)
          ~ resource_name   = "vll" -> (known after apply)
          ~ resource_type   = "vll" -> (known after apply)
        } -> (known after apply)
      ~ vxc_approval         = {
          ~ message   = "" -> (known after apply)
          ~ new_speed = 0 -> (known after apply)
          ~ status    = "" -> (known after apply)
          ~ type      = "" -> (known after apply)
          ~ uid       = "" -> (known after apply)
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

megaport_port.ipxgrx: Modifying...
megaport_vxc.internet: Modifying...
megaport_vxc.aws: Modifying...
megaport_port.ipxgrx: Still modifying... [10s elapsed]
megaport_port.ipxgrx: Still modifying... [20s elapsed]
megaport_port.ipxgrx: Still modifying... [30s elapsed]
megaport_port.ipxgrx: Modifications complete after 33s
megaport_vxc.ipxgrx: Modifying...
╷
│ Error: Error Updating VXC
│ 
│   with megaport_vxc.internet,
│   on main.tf line 50, in resource "megaport_vxc" "internet":
│   50: resource "megaport_vxc" "internet" {
│ 
│ Could not update VXC with ID a3b3b399-7bcc-4d63-8fd7-11f3bd785075: PUT https://api-staging.megaport.com/v3/product/vxc/a3b3b399-7bcc-4d63-8fd7-11f3bd785075: 403 (trace_id "60b351b9b895d564e0a3137160a76b2d") Only B end owner can change B VLAN 
╵
╷
│ Error: Error Updating VXC
│ 
│   with megaport_vxc.ipxgrx,
│   on main.tf line 67, in resource "megaport_vxc" "ipxgrx":
│   67: resource "megaport_vxc" "ipxgrx" {
│ 
│ Could not update VXC with ID ac8a0136-66d1-4593-ac26-f0e99ebeb1ca: PUT https://api-staging.megaport.com/v3/product/vxc/ac8a0136-66d1-4593-ac26-f0e99ebeb1ca: 409 (trace_id "5f1eea1de66006ca6269027229f015ce") Service term cannot be extended. 
╵
╷
│ Error: Error Updating VXC
│ 
│   with megaport_vxc.aws,
│   on main.tf line 86, in resource "megaport_vxc" "aws":
│   86: resource "megaport_vxc" "aws" {
│ 
│ Could not update VXC with ID bf2d1de5-9745-4f64-baea-242e8b587004: PUT https://api-staging.megaport.com/v3/product/vxc/bf2d1de5-9745-4f64-baea-242e8b587004: 403 (trace_id "06083e58643ff1eda359c48a1d35c5d4") Only B end owner can change B VLAN 
```